<script type="application/ld+json">{"@context":"https://schema.org","@graph":[{"@type":"WebSite","@id":"https://tsaprecheckbytelos.tsa.dhs.gov/#website","url":"https://tsaprecheckbytelos.tsa.dhs.gov/","name":"TSA PreCheck by Telos"},{"@type":"WebPage","@id":"https://tsaprecheckbytelos.tsa.dhs.gov/tsa-precheck-faq#webpage","url":"https://tsaprecheckbytelos.tsa.dhs.gov/tsa-precheck-faq","isPartOf":{"@id":"https://tsaprecheckbytelos.tsa.dhs.gov/#website"},"name":"TSA PreCheck by Telos – FAQs","inLanguage":"en","primaryImageOfPage":{"@type":"ImageObject","url":"https://www.telos.com/wp-content/uploads/2021/01/Telos.jpg"}},{"@type":"Organization","@id":"https://www.telos.com/","name":"Telos Corporation","url":"https://www.telos.com/","logo":{"@type":"ImageObject","url":"https://www.telos.com/wp-content/uploads/2021/01/Telos.jpg"},"sameAs":["https://tsaprecheckbytelos.tsa.dhs.gov/"]},{"@type":"FAQPage","@id":"https://tsaprecheckbytelos.tsa.dhs.gov/tsa-precheck-faq#faq","mainEntity":[{"@type":"Question","name":"What do I do if I believe I should have the TSA PreCheck® indicator on my boarding pass but did not receive it?","acceptedAnswer":{"@type":"Answer","text":"Verify your membership is still valid (lookup: https://tsaenrollmentbyidemia.tsa.dhs.gov/ktn-lookup). Ensure your reservation name, date of birth, and KTN are correct. If issues remain, contact the TSA Contact Center at (866) 289-9673, submit an online form at https://www.tsa.gov/contact/contact-forms, or contact @AskTSA on Twitter or Facebook Messenger."}},{"@type":"Question","name":"How was the application fee determined?","acceptedAnswer":{"@type":"Answer","text":"The fee covers five years of eligibility and operational costs of the TSA PreCheck® program. See TSA’s fee development report: https://www.tsa.gov/sites/default/files/fee-development-report.pdf"}},{"@type":"Question","name":"How do I apply for TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"Complete the online application (about five minutes) and schedule an in-person appointment at a Telos enrollment center. Onsite (about ten minutes) includes document scan, photo, fingerprints, and payment. Telos securely transmits your data to TSA; TSA makes the final eligibility decision."}},{"@type":"Question","name":"What are common application mistakes that delay approval of my TSA PreCheck® enrollment?","acceptedAnswer":{"@type":"Answer","text":"Common delays include: arriving without required identity/citizenship documents; name mismatch without legal linking documents; presenting unacceptable or illegible birth documents; or arriving without an accepted payment method. These issues can require rescheduling and prevent submission to TSA until corrected."}},{"@type":"Question","name":"How do I renew my TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"Renew online or in person up to six months before KTN expiration. Submitting multiple renewals may cause delays; refunds are not issued for duplicate submissions. Some individuals may not be able to renew online due to exceptions."}},{"@type":"Question","name":"What is Telos's price for TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"New enrollment: $85. Renewals: $70 (online or in person)."}},{"@type":"Question","name":"Is Telos an authorized TSA PreCheck® enrollment provider?","acceptedAnswer":{"@type":"Answer","text":"Yes. Telos is an authorized TSA PreCheck® enrollment provider. See TSA’s official site: https://www.tsa.gov/precheck"}},{"@type":"Question","name":"What is TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"TSA PreCheck® is a DHS Trusted Traveler program providing expedited security screening at 200+ airports with 85+ participating airlines. Learn more: https://www.tsa.gov/precheck"}},{"@type":"Question","name":"Who can I contact with questions about TSA PreCheck® enrollment and renewal?","acceptedAnswer":{"@type":"Answer","text":"Contact Telos Customer Service at 833-777-1811 (weekdays 8 AM–10 PM ET; weekends/holidays 9 AM–8 PM ET) or email support@telosid.com."}},{"@type":"Question","name":"How do I ensure TSA PreCheck appears on my boarding pass?","acceptedAnswer":{"@type":"Answer","text":"Include your KTN when booking. Participating airlines display an indicator such as TSAPRECHK, TSA PRE, or TSA PreCheck® on your boarding pass if eligible. Without the indicator, you cannot access the lane."}},{"@type":"Question","name":"What is a TSA PreCheck® enrollment provider?","acceptedAnswer":{"@type":"Answer","text":"A provider contracted by TSA to collect enrollment information and submit data to TSA and the FBI. TSA oversees the process and makes final eligibility decisions."}},{"@type":"Question","name":"How will I know that I have been approved for TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"You will receive confirmation via the notification method selected (email, text, or phone). You can also check status in the “My Application” section. Add your KTN to any flight reservations."}},{"@type":"Question","name":"How long does my TSA PreCheck® membership last?","acceptedAnswer":{"@type":"Answer","text":"Membership is valid for 5 years."}},{"@type":"Question","name":"Does Telos provide Global Entry enrollment services?","acceptedAnswer":{"@type":"Answer","text":"No. Telos is authorized for TSA PreCheck® only. Global Entry is operated by U.S. Customs and Border Protection. Learn more: https://ttp.dhs.gov/"}},{"@type":"Question","name":"Do gate passes give TSA PreCheck® benefits to parents accompanying minors through security?","acceptedAnswer":{"@type":"Answer","text":"No. Gate pass holders are directed to standard screening even if enrolled in TSA PreCheck®."}},{"@type":"Question","name":"Do children need to apply for TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"Ages 12 and under may accompany an enrolled parent/guardian in TSA PreCheck® lanes without restriction. Ages 13–17 on the same reservation may use PreCheck if their boarding pass shows the indicator. Children traveling alone may wish to enroll. Gate pass holders are excluded from PreCheck benefits."}},{"@type":"Question","name":"How does Telos protect the privacy of the information I provide?","acceptedAnswer":{"@type":"Answer","text":"Telos meets NIST and DHS security requirements. Application data is encrypted and transmitted securely, stored in secure facilities, and not saved on enrollment equipment. Authorized personnel undergo DHS background checks and training; systems are monitored and audited."}},{"@type":"Question","name":"Who is eligible for TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"U.S. Citizens, U.S. Nationals, and Lawful Permanent Residents. Applicants may be ineligible due to incomplete/false information, security violations, or disqualifying offenses: https://www.tsa.gov/disqualifying-offenses-factors"}},{"@type":"Question","name":"What are examples of possible driver's licenses (valid photo ID)?","acceptedAnswer":{"@type":"Answer","text":"Starting May 1, 2025, non-REAL ID driver’s licenses and non-REAL ID state IDs (including temporary/paper-based) are not accepted for in-person enrollment or renewal. REAL ID markings include: gold star, black star, white star in gold circle/black circle/gold bear. Unexpired Enhanced DLs/IDs (MI, MN, NY, VT, WA) show “Enhanced” and a U.S. flag."}},{"@type":"Question","name":"How do I find an enrollment center location near me?","acceptedAnswer":{"@type":"Answer","text":"Use TSA’s site locator: https://www.tsa.gov/precheck/enrollment-centers"}},{"@type":"Question","name":"Why does the airline matter in using the TSA PreCheck® lanes?","acceptedAnswer":{"@type":"Answer","text":"Passengers must be traveling on an airline partnered with TSA to offer TSA PreCheck®."}},{"@type":"Question","name":"Can my family use the TSA PreCheck® lane when they are traveling with me?","acceptedAnswer":{"@type":"Answer","text":"Children 12 and under may use the lane with an enrolled parent/guardian. Ages 13–17 on the same reservation may use it if their boarding pass shows the indicator. Children traveling alone should enroll. Adults with gate passes are excluded. Spouses must apply and, if approved, may use the lane when their boarding pass shows the indicator."}},{"@type":"Question","name":"Does my boarding pass show that I can use the TSA PreCheck® lane?","acceptedAnswer":{"@type":"Answer","text":"Yes. Participating airlines print a TSA PreCheck® indicator (e.g., TSAPRECHK, TSA PRE, TSA PreCheck®) on boarding passes."}},{"@type":"Question","name":"Which airlines participate in TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"See current airports and airlines: https://www.tsa.gov/precheck/map"}},{"@type":"Question","name":"What happens when there isn’t a dedicated TSA PreCheck® lane?","acceptedAnswer":{"@type":"Answer","text":"PreCheck screening may be available through the standard lane. Show your PreCheck boarding pass; you may be able to keep liquids/laptops in your bag and shoes/light jackets on. Ask the TSA officer."}},{"@type":"Question","name":"Must the name on my flight reservation match the name on my application?","acceptedAnswer":{"@type":"Answer","text":"Yes. The reservation name must exactly match your application name. Ensure frequent flyer and travel profiles are saved correctly."}},{"@type":"Question","name":"My personal information has changed. How do I update my information so that I can continue to receive TSA PreCheck® benefits?","acceptedAnswer":{"@type":"Answer","text":"If you enrolled with Telos, call 833-777-1811 (hours above) or email support@telosid.com to update records. You will be advised on required documentation. Name changes must be updated to use benefits."}},{"@type":"Question","name":"If I am a TSA PreCheck® member, am I always guaranteed expedited screening?","acceptedAnswer":{"@type":"Answer","text":"No. TSA uses unpredictable security measures; expedited screening is not guaranteed."}},{"@type":"Question","name":"Can I use TSA PreCheck® for international flights originating at a U.S. airport?","acceptedAnswer":{"@type":"Answer","text":"Yes. Available when departing the U.S. and for domestic connections after returning. Frequent international travelers may consider Global Entry (includes PreCheck): https://www.cbp.gov/travel/trusted-traveler-programs/global-entry"}},{"@type":"Question","name":"How do I use my known traveler number or KTN?","acceptedAnswer":{"@type":"Answer","text":"Enter your KTN in each reservation with participating airlines and save it in frequent flyer and booking profiles."}},{"@type":"Question","name":"I have more than one KTN. Which should I use?","acceptedAnswer":{"@type":"Answer","text":"Use any active KTN, ensuring your airline has the exact name and date of birth associated with that KTN and that the reservation includes it."}},{"@type":"Question","name":"How do I add my KTN to existing flight reservations?","acceptedAnswer":{"@type":"Answer","text":"Contact your airline by phone or online to add your KTN. Ensure your full name, date of birth, and KTN match your enrollment details."}},{"@type":"Question","name":"I forgot my KTN. How do I find it?","acceptedAnswer":{"@type":"Answer","text":"If enrolled in TSA PreCheck®, look up your KTN: https://tsaenrollmentbyidemia.tsa.dhs.gov/ktn-lookup. For Global Entry/NEXUS/SENTRI, log in to https://ttp.dhs.gov/ for your PASSID (KTN). For HME, TWIC®, or DoD programs, see their respective links. For help, submit https://www.tsa.gov/contact/contact-forms or call 833-777-1811 (support@telosid.com)."}},{"@type":"Question","name":"How do I add my KTN to a participating airline’s frequent flyer profile?","acceptedAnswer":{"@type":"Answer","text":"Update each participating airline profile individually (usually online). You can also add your KTN on booking sites like Expedia or Orbitz. Profile updates do not retroactively update existing reservations."}},{"@type":"Question","name":"I booked my travel via a third-party website and/or travel agency; will I receive TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"Call your airline after booking to confirm your KTN, name, and date of birth transmitted correctly; third-party systems may not always pass data properly."}},{"@type":"Question","name":"Will I keep my same KTN after I renew?","acceptedAnswer":{"@type":"Answer","text":"Yes, if you renew within one year of expiration. After one year, apply as a new applicant and you will receive a new KTN if approved."}},{"@type":"Question","name":"Can I renew my TSA PreCheck® membership if my name has changed?","acceptedAnswer":{"@type":"Answer","text":"Call 833-777-1811 to submit a name change request before renewing online (processing may take up to 45 days). Or renew in person at an enrollment center: https://tsaprecheckbytelos.tsa.dhs.gov/locations/"}},{"@type":"Question","name":"How long does it take to get approved?","acceptedAnswer":{"@type":"Answer","text":"Most applicants are approved in 3–5 days, though some may take up to 60 days. Renew at least 60 days prior to expiration. Telos will notify you of results."}},{"@type":"Question","name":"I booked before my KTN expiration date, but my flight is after my KTN expiration date. Will I still get TSA PreCheck® on my boarding pass?","acceptedAnswer":{"@type":"Answer","text":"No. You will not receive TSA PreCheck® if your KTN is expired. Renew before expiration to continue benefits."}},{"@type":"Question","name":"How much does TSA PreCheck® renewal cost?","acceptedAnswer":{"@type":"Answer","text":"$70 for a five-year renewal (online or in person). Promotional offers may occur; opt in to communications to stay updated."}},{"@type":"Question","name":"How will I know when my TSA PreCheck® membership expires?","acceptedAnswer":{"@type":"Answer","text":"You will receive renewal notifications 6 months, 3 months, 1 month, and 2 weeks prior to expiration (if contact info is on record). Check status online: https://tsaprecheckbytelos.tsa.dhs.gov/enrollment-precheck-signin"}},{"@type":"Question","name":"Can I renew with Telos if I initially enrolled with another authorized TSA PreCheck® enrollment provider?","acceptedAnswer":{"@type":"Answer","text":"Yes. You may renew with Telos regardless of where you originally enrolled."}},{"@type":"Question","name":"Why would I need to renew in person?","acceptedAnswer":{"@type":"Answer","text":"Some individuals must renew in person (e.g., unresolved name changes). Visit an enrollment center or call 833-777-1811. Name changes may take up to 45 days."}},{"@type":"Question","name":"How do I renew my TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"Renew online or in person up to 6 months before your KTN expiration. Some individuals may not be able to renew online due to exceptions."}},{"@type":"Question","name":"When can I renew my TSA PreCheck® membership?","acceptedAnswer":{"@type":"Answer","text":"You may renew online up to six months before expiration; the new membership begins as the current one ends. TSA recommends renewing at least 90 days prior to expiration."}},{"@type":"Question","name":"I think I may have fraudulently enrolled in TSA PreCheck®, what do I do? Can I get a refund?","acceptedAnswer":{"@type":"Answer","text":"Report the scam to local police and file at https://reportfraud.ftc.gov/. Contact your bank/credit card company. Telos and TSA do not reimburse charges from fraudulent websites."}},{"@type":"Question","name":"What happens after I submit my application?","acceptedAnswer":{"@type":"Answer","text":"Telos securely submits your application to TSA and notifies you via your selected method (phone, email, or text). You can track status online. Most applicants receive a KTN in 3–5 days; some take up to 60 days."}},{"@type":"Question","name":"Will I receive an ID card or other credential to use TSA PreCheck® lanes?","acceptedAnswer":{"@type":"Answer","text":"No. You receive a Known Traveler Number (KTN). Enter your KTN in your airline reservation to receive the TSA PreCheck® indicator on your boarding pass."}},{"@type":"Question","name":"What documentation do I need to provide when applying for TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"See required identification: https://www.tsa.gov/precheck/required-Identification"}},{"@type":"Question","name":"How do I pay for my TSA PreCheck® application?","acceptedAnswer":{"@type":"Answer","text":"Pay by credit/debit card; tap-to-pay (digital wallets) supported for Mastercard, Visa, Discover, and American Express. Cash, checks, money orders, PayPal, and Venmo are not accepted."}},{"@type":"Question","name":"Do I have to use my full legal name on my application, or can I use a nickname?","acceptedAnswer":{"@type":"Answer","text":"Use your exact legal name as shown on your identification and citizenship/immigration documents, and the same name on airline reservations."}},{"@type":"Question","name":"Why do I need to provide previous names or aliases on my application?","acceptedAnswer":{"@type":"Answer","text":"This information is used for the TSA background check."}},{"@type":"Question","name":"How do I get TSA PreCheck® as a member of the U.S. Armed Forces? Do I need to enroll through Telos to get TSA PreCheck?","acceptedAnswer":{"@type":"Answer","text":"No. Enter the DoD ID number from your CAC as your KTN in reservations or update your Defense Travel System profile for official travel. DoD federal civilian employees must opt in via milConnect."}},{"@type":"Question","name":"How do I report a Personal Identifiable Information (PII) breach to the FBI?","acceptedAnswer":{"@type":"Answer","text":"See the FBI Cyber Incident Reporting Brochure: https://www.fbi.gov/file-repository/cyber-incident-reporting-united-message-final.pdf/view"}},{"@type":"Question","name":"How do I view the FBI Privacy Act Statement and the Noncriminal Justice Applicant's Privacy Rights?","acceptedAnswer":{"@type":"Answer","text":"FBI Privacy Act Statement: https://www.fbi.gov/how-we-can-help-you/more-fbi-services-and-information/compact-council/privacy-act-statement; Noncriminal Justice Applicant's Privacy Rights: https://www.fbi.gov/how-we-can-help-you/more-fbi-services-and-information/compact-council/guiding-principles-noncriminal-justice-applicants-privacy-rights"}},{"@type":"Question","name":"How would I learn more about FBI Identity History Summary checks?","acceptedAnswer":{"@type":"Answer","text":"See https://www.fbi.gov/checks for Identity History Summary Checks."}},{"@type":"Question","name":"What are military survivor families and how would someone know if they are part of that group?","acceptedAnswer":{"@type":"Answer","text":"Families whose loved one died while serving in the U.S. armed forces, including those eligible for the Gold Star Lapel Button (10 U.S.C. § 1126) or the Next of Kin Lapel Button (est. 1977, retroactive to Mar 28, 1973), and families of those who died from a service-connected injury or illness after separation."}},{"@type":"Question","name":"What will family members need to bring with them to get the free TSA PreCheck® enrollment or renewal?","acceptedAnswer":{"@type":"Answer","text":"For in-person enrollments/renewals, bring required proof of citizenship and identity plus a TAPS verification letter or TSA acknowledgment form (see https://www.tsa.gov/precheck/required-identification). For online renewals, upload the verification letter or TSA form; you will be charged $70 and receive a full rebate within 5 business days after review."}},{"@type":"Question","name":"What documents are used to verify the eligibility of a military survivor family member?","acceptedAnswer":{"@type":"Answer","text":"TAPS provides a verification letter (https://www.taps.org/). Contact TAPS 24/7 at 800-959-TAPS (8277) or 202-588-TAPS (8277) or email info@taps.org. Alternatively, contact the TSA Contact Center at 866-289-9673 or https://www.tsa.gov/email to request a TSA acknowledgment form."}},{"@type":"Question","name":"Does each individual family member need their own letter?","acceptedAnswer":{"@type":"Answer","text":"Yes."}},{"@type":"Question","name":"What if I need assistance completing my application?","acceptedAnswer":{"@type":"Answer","text":"Contact customer service at 833-777-1811 (weekdays 8 AM–10 PM ET; weekends/holidays 9 AM–8 PM ET) or email support@telosid.com."}},{"@type":"Question","name":"Can I get TSA PreCheck® for free due to my disability or medical condition?","acceptedAnswer":{"@type":"Answer","text":"No. The application fee funds the background check and cannot be waived."}},{"@type":"Question","name":"Does my disability or medical condition give me access to the TSA PreCheck® lane?","acceptedAnswer":{"@type":"Answer","text":"No. Only travelers with a valid boarding pass showing the TSA PreCheck® indicator may use TSA PreCheck® lanes."}},{"@type":"Question","name":"Which branches are eligible?","acceptedAnswer":{"@type":"Answer","text":"Spouses of currently serving uniformed service members in the Army, Marine Corps, Navy, Air Force, Space Force, Coast Guard, Public Health Service Commissioned Corps, and NOAA Commissioned Officer Corps. Not available to spouses of retired service members."}},{"@type":"Question","name":"What do military spouses need to provide to get the $25 discount?","acceptedAnswer":{"@type":"Answer","text":"An unexpired U.S. Department of Defense/Uniformed Services photo ID with relationship listed as \"Spouse.\" Details: https://www.tsa.gov/precheck/military"}},{"@type":"Question","name":"Will military spouses also get a discount on their renewal fee?","acceptedAnswer":{"@type":"Answer","text":"Yes. In-person renewals: $45 (i.e., $25 off $70). For online renewals, upload a photo of the DoD/Uniformed Services ID; you will be charged $70 and receive a $25 rebate within 5 business days after review."}},{"@type":"Question","name":"What is the TSA PreCheck® BOGO Family Discount?","acceptedAnswer":{"@type":"Answer","text":"A limited-time offer taking $15 off the second enrollment when two first-time customers enroll together at the same location, day, and time. No proof of relationship required. Odd-numbered groups: the extra person pays full price. See details at https://www.tsa.gov/precheck/families"}},{"@type":"Question","name":"Can I be disqualified/suspended from TSA PreCheck®?","acceptedAnswer":{"@type":"Answer","text":"Yes. Violations such as interference with crew, assault, prohibited items, access control violations, or fraudulent documents can lead to disqualification/suspension. Enrollees undergo recurrent vetting. For questions, call (866) 289-9673, submit https://www.tsa.gov/contact/contact-forms, or contact @AskTSA on Twitter/Facebook Messenger."}}]}]}</script>
